{
    "en": [
        {
            "id": 1,
            "title": "Spotlight of the Month Award (2x)",
            "description": "Recognized twice for AI innovation at Vuram Technologies",
            "image": "/portfolio/images/achievement.png",
            "date": "2023-06-15",
            "detailedDescription": "Received the prestigious Spotlight of the Month award twice during tenure at Vuram Technologies for exceptional contributions to AI innovation. The recognition came from successfully implementing LLM-based customer support automation and leading intelligent document processing projects that significantly improved operational efficiency."
        },
        {
            "id": 2,
            "title": "CGPA 9.40 - B.E. Mechatronics",
            "description": "Graduated with distinction from SKCET, Coimbatore",
            "image": "/portfolio/images/achievement.png",
            "date": "2022-05-01",
            "detailedDescription": "Achieved an outstanding CGPA of 9.40 out of 10 in Bachelor of Engineering (Mechatronics) from Sri Krishna College of Engineering and Technology, Coimbatore. Consistently ranked among the top performers in the class while actively participating in research and project work."
        },
        {
            "id": 3,
            "title": "Patent: Self-Balance Electric Two-Wheeler",
            "description": "Awarded patent for innovative gyroscopic vehicle design",
            "image": "/portfolio/images/achievement.png",
            "date": "2022-03-10",
            "detailedDescription": "Successfully obtained a patent for the development of a gyroscopic design for a self-balancing two-wheeled electric vehicle system. The invention demonstrates novel application of control systems and robotics in sustainable transportation."
        },
        {
            "id": 4,
            "title": "Patent: Egg Quality Detection Device",
            "description": "Patented handheld device for egg freshness assessment",
            "image": "/portfolio/images/achievement.png",
            "date": "2022-04-20",
            "detailedDescription": "Received patent for inventing a handheld device that forecasts and detects egg quality using weight and temperature measurements. The device helps consumers make informed purchasing decisions and reduces food waste."
        },
        {
            "id": 5,
            "title": "IEEE Published Research Paper",
            "description": "Published in IEEE - BIN Bot Robot Technology",
            "image": "/portfolio/images/achievement.png",
            "date": "2021-11-15",
            "detailedDescription": "Published research paper in IEEE conference proceedings on 'Technology in Design Aspect of BIN Bot Robot'. The paper discusses the innovative design of an autonomous robot aimed at reducing disease spread in institutional and industrial environments."
        },
        {
            "id": 6,
            "title": "IOP Science Publication",
            "description": "AR for E-education and Training (ICMMM)",
            "image": "/portfolio/images/achievement.png",
            "date": "2021-09-05",
            "detailedDescription": "Published research in IOP Science Materials Science and Engineering journal on 'Development of App Incorporating AR for E-edu and Training'. The work presents a visual platform using 3D visuals and Augmented Reality to enhance learning experiences."
        },
        {
            "id": 7,
            "title": "IEEE Published - Hose Cutting Machine",
            "description": "Automatic hose cutting machine research publication",
            "image": "/portfolio/images/achievement.png",
            "date": "2022-06-10",
            "detailedDescription": "Published research paper in IEEE on 'Design and Fabrication of Automatic Hose Cutting Machine'. The study offers an innovative solution to precise hose cutting in industrial applications, improving efficiency and reducing waste."
        },
        {
            "id": 8,
            "title": "JCREVIEW Publication",
            "description": "Self-balancing vehicle research published",
            "image": "/portfolio/images/achievement.png",
            "date": "2022-02-20",
            "detailedDescription": "Published comprehensive research paper in JCREVIEW journal on 'Design of Self Balance Electric 2-Wheeler Using Gyroscope'. The paper discusses the concept, simulation, and construction of an innovative self-balancing vehicle system."
        },
        {
            "id": 9,
            "title": "HSC - 93.7% Achievement",
            "description": "Stanes Anglo Indian Higher Secondary School",
            "image": "/portfolio/images/achievement.png",
            "date": "2018-04-01",
            "detailedDescription": "Secured 93.7% in Higher Secondary Certificate (HSC) examination from Stanes Anglo Indian Higher Secondary School, Coonoor. Demonstrated strong academic performance across science and mathematics subjects."
        },
        {
            "id": 10,
            "title": "SSLC - 93.2% Achievement",
            "description": "Secondary School Leaving Certificate excellence",
            "image": "/portfolio/images/achievement.png",
            "date": "2016-04-01",
            "detailedDescription": "Achieved 93.2% in Secondary School Leaving Certificate (SSLC) examination from Stanes Anglo Indian Higher Secondary School, Coonoor. Laid a strong foundation for future academic pursuits in engineering and technology."
        },
        {
            "id": 11,
            "title": "Selected for TU Dortmund M.S. Program",
            "description": "Admitted to prestigious AI specialization program",
            "image": "/portfolio/images/achievement.png",
            "date": "2023-09-01",
            "detailedDescription": "Selected for the highly competitive Master of Science in Automation and Robotics program with specialization in Artificial Intelligence at TU Dortmund, Germany. The program focuses on advanced AI, robotics, and automation technologies."
        }
    ],
    "de": [
        {
            "id": 1,
            "title": "Spotlight of the Month Award (2x)",
            "description": "Zweimal für KI-Innovation bei Vuram Technologies ausgezeichnet",
            "image": "/portfolio/images/achievement.png",
            "date": "2023-06-15",
            "detailedDescription": "Erhielt zweimal während der Tätigkeit bei Vuram Technologies den prestigeträchtigen Spotlight of the Month Award für außergewöhnliche Beiträge zur KI-Innovation. Die Anerkennung kam von der erfolgreichen Implementierung LLM-basierter Kundensupport-Automatisierung und der Leitung intelligenter Dokumentenverarbeitungsprojekte, die die operative Effizienz erheblich verbesserten."
        },
        {
            "id": 2,
            "title": "CGPA 9.40 - B.E. Mechatronik",
            "description": "Mit Auszeichnung von SKCET, Coimbatore, absolviert",
            "image": "/portfolio/images/achievement.png",
            "date": "2022-05-01",
            "detailedDescription": "Erreichte einen herausragenden CGPA von 9,40 von 10 im Bachelor of Engineering (Mechatronik) am Sri Krishna College of Engineering and Technology, Coimbatore. Gehörte durchweg zu den besten Absolventen der Klasse und beteiligte sich aktiv an Forschung und Projektarbeit."
        },
        {
            "id": 3,
            "title": "Patent: Selbstbalancierendes Elektro-Zweirad",
            "description": "Patent für innovatives gyroskopisches Fahrzeugdesign erhalten",
            "image": "/portfolio/images/achievement.png",
            "date": "2022-03-10",
            "detailedDescription": "Erfolgreich ein Patent für die Entwicklung eines gyroskopischen Designs für ein selbstbalancierendes zweirädriges Elektrofahrzeugsystem erhalten. Die Erfindung demonstriert neuartige Anwendung von Steuerungssystemen und Robotik in nachhaltiger Mobilität."
        },
        {
            "id": 4,
            "title": "Patent: Eierqualitäts-Erkennungsgerät",
            "description": "Patentiertes Handgerät zur Eierfrische-Bewertung",
            "image": "/portfolio/images/achievement.png",
            "date": "2022-04-20",
            "detailedDescription": "Erhielt Patent für die Erfindung eines Handgeräts, das Eierqualität mithilfe von Gewichts- und Temperaturmessungen vorhersagt und erkennt. Das Gerät hilft Verbrauchern, fundierte Kaufentscheidungen zu treffen und Lebensmittelverschwendung zu reduzieren."
        },
        {
            "id": 5,
            "title": "IEEE Veröffentlichtes Forschungspapier",
            "description": "Veröffentlicht in IEEE - BIN Bot Robotertechnologie",
            "image": "/portfolio/images/achievement.png",
            "date": "2021-11-15",
            "detailedDescription": "Veröffentlichte Forschungsarbeit in IEEE-Konferenzberichten über 'Technologie im Designaspekt des BIN Bot Roboters'. Das Papier diskutiert das innovative Design eines autonomen Roboters zur Reduzierung der Krankheitsausbreitung in institutionellen und industriellen Umgebungen."
        },
        {
            "id": 6,
            "title": "IOP Science Publikation",
            "description": "AR für E-Bildung und Training (ICMMM)",
            "image": "/portfolio/images/achievement.png",
            "date": "2021-09-05",
            "detailedDescription": "Veröffentlichte Forschung im IOP Science Materials Science and Engineering Journal über 'Entwicklung einer App mit AR für E-Bildung und Training'. Die Arbeit präsentiert eine visuelle Plattform mit 3D-Visualisierungen und Augmented Reality zur Verbesserung von Lernerfahrungen."
        },
        {
            "id": 7,
            "title": "IEEE Veröffentlicht - Schlauchschneidemaschine",
            "description": "Forschungspublikation zur automatischen Schlauchschneidemaschine",
            "image": "/portfolio/images/achievement.png",
            "date": "2022-06-10",
            "detailedDescription": "Veröffentlichte Forschungsarbeit in IEEE über 'Design und Herstellung einer automatischen Schlauchschneidemaschine'. Die Studie bietet eine innovative Lösung für präzises Schlauchschneiden in industriellen Anwendungen, verbessert Effizienz und reduziert Abfall."
        },
        {
            "id": 8,
            "title": "JCREVIEW Publikation",
            "description": "Selbstbalancierendes Fahrzeug Forschung veröffentlicht",
            "image": "/portfolio/images/achievement.png",
            "date": "2022-02-20",
            "detailedDescription": "Veröffentlichte umfassende Forschungsarbeit im JCREVIEW Journal über 'Design eines selbstbalancierenden Elektro-Zweirads mit Gyroskop'. Das Papier diskutiert das Konzept, die Simulation und den Bau eines innovativen selbstbalancierenden Fahrzeugsystems."
        },
        {
            "id": 9,
            "title": "HSC - 93,7% Leistung",
            "description": "Stanes Anglo Indian Higher Secondary School",
            "image": "/portfolio/images/achievement.png",
            "date": "2018-04-01",
            "detailedDescription": "Erreichte 93,7% in der Higher Secondary Certificate (HSC) Prüfung der Stanes Anglo Indian Higher Secondary School, Coonoor. Zeigte starke akademische Leistung in Naturwissenschaften und Mathematik."
        },
        {
            "id": 10,
            "title": "SSLC - 93,2% Leistung",
            "description": "Secondary School Leaving Certificate Exzellenz",
            "image": "/portfolio/images/achievement.png",
            "date": "2016-04-01",
            "detailedDescription": "Erreichte 93,2% in der Secondary School Leaving Certificate (SSLC) Prüfung der Stanes Anglo Indian Higher Secondary School, Coonoor. Legte eine starke Grundlage für zukünftige akademische Bestrebungen in Ingenieurwesen und Technologie."
        },
        {
            "id": 11,
            "title": "Ausgewählt für TU Dortmund M.S. Programm",
            "description": "Zugelassen zu prestigeträchtigem KI-Spezialisierungsprogramm",
            "image": "/portfolio/images/achievement.png",
            "date": "2023-09-01",
            "detailedDescription": "Ausgewählt für das hochkompetitive Master of Science Programm in Automatisierung und Robotik mit Spezialisierung auf Künstliche Intelligenz an der TU Dortmund, Deutschland. Das Programm konzentriert sich auf fortgeschrittene KI, Robotik und Automatisierungstechnologien."
        }
    ]
}