{
    "en": [
        {
            "id": 1,
            "title": "AR Education Platform",
            "description": "Augmented Reality app for interactive learning",
            "image": "/portfolio/images/hobby-project.png",
            "technologies": [
                "Unity",
                "AR Foundation",
                "C#",
                "3D Modeling"
            ],
            "detailedDescription": "Developed an Augmented Reality educational platform that helps learners enhance their understanding using 3D visuals and AR technology. The app transforms traditional learning materials into interactive 3D experiences, making complex concepts easier to grasp through immersive visualization."
        },
        {
            "id": 2,
            "title": "Crop Health Monitoring System",
            "description": "CNN-based deep learning model for agriculture",
            "image": "/portfolio/images/hobby-project.png",
            "technologies": [
                "Python",
                "TensorFlow",
                "Keras",
                "OpenCV",
                "Remote Sensing"
            ],
            "detailedDescription": "Created a CNN deep learning model for crop health monitoring using remote sensing data. The system analyzes satellite and drone imagery to detect plant diseases, nutrient deficiencies, and optimize irrigation schedules. Achieved 92% accuracy in disease detection across multiple crop types."
        },
        {
            "id": 3,
            "title": "BIN Bot - COVID Safety Robot",
            "description": "Autonomous robot for waste management and safety",
            "image": "/portfolio/images/hobby-project.png",
            "technologies": [
                "ROS",
                "Python",
                "Computer Vision",
                "Arduino",
                "Sensors"
            ],
            "detailedDescription": "Designed and built an autonomous robot aimed at reducing disease spread in institutions and workplaces. The BIN Bot incorporates computer vision for navigation, automatic waste collection capabilities, and COVID-19 safety protocol enforcement through contactless operations."
        },
        {
            "id": 4,
            "title": "Automatic Hose Cutting Machine",
            "description": "Precision automated cutting system for industrial use",
            "image": "/portfolio/images/hobby-project.png",
            "technologies": [
                "PLC",
                "HMI",
                "Automation",
                "Mechanical Design"
            ],
            "detailedDescription": "Designed and fabricated an automatic hose cutting machine that provides a solution to the time-consuming process of precise hose cutting in industrial settings. The system uses PLC programming for accurate length measurement and cutting, reducing waste and improving production efficiency by 60%."
        },
        {
            "id": 5,
            "title": "Egg Quality Detection Device",
            "description": "IoT device for smart egg quality assessment",
            "image": "/portfolio/images/hobby-project.png",
            "technologies": [
                "Arduino",
                "Sensors",
                "IoT",
                "Mobile App"
            ],
            "detailedDescription": "Invented a handheld device that forecasts and detects egg quality for consumers. The device measures weight and temperature, using these parameters to determine egg freshness and predict expiration dates. The accompanying mobile app displays quality scores and freshness indicators."
        },
        {
            "id": 6,
            "title": "Humanoid Employee Tracking Bot",
            "description": "AI-powered robot for workplace automation",
            "image": "/portfolio/images/hobby-project.png",
            "technologies": [
                "Python",
                "Computer Vision",
                "Deep Learning",
                "ROS",
                "Face Recognition"
            ],
            "detailedDescription": "Developed as a final year project at ELGI R&D, this humanoid bot automates employee tracking and ensures COVID SOP compliance. Implemented deep learning models for face recognition, social distancing detection, and mask detection with real-time alerts and reporting capabilities."
        },
        {
            "id": 7,
            "title": "AI Code Assistant",
            "description": "LLM-powered coding companion",
            "image": "/portfolio/images/hobby-project.png",
            "technologies": [
                "Python",
                "GPT",
                "VS Code Extension",
                "TypeScript"
            ],
            "detailedDescription": "Built an intelligent coding assistant that leverages LLMs to provide code suggestions, bug detection, and documentation generation. The tool integrates seamlessly with popular IDEs and supports multiple programming languages, helping developers write better code faster."
        }
    ],
    "de": [
        {
            "id": 1,
            "title": "AR-Bildungsplattform",
            "description": "Augmented Reality App für interaktives Lernen",
            "image": "/portfolio/images/hobby-project.png",
            "technologies": [
                "Unity",
                "AR Foundation",
                "C#",
                "3D-Modellierung"
            ],
            "detailedDescription": "Entwickelte eine Augmented Reality-Bildungsplattform, die Lernenden hilft, ihr Verständnis durch 3D-Visualisierungen und AR-Technologie zu verbessern. Die App verwandelt traditionelle Lernmaterialien in interaktive 3D-Erlebnisse und macht komplexe Konzepte durch immersive Visualisierung leichter verständlich."
        },
        {
            "id": 2,
            "title": "Pflanzengesundheits-Überwachungssystem",
            "description": "CNN-basiertes Deep Learning-Modell für die Landwirtschaft",
            "image": "/portfolio/images/hobby-project.png",
            "technologies": [
                "Python",
                "TensorFlow",
                "Keras",
                "OpenCV",
                "Fernerkundung"
            ],
            "detailedDescription": "Erstellte ein CNN-Deep-Learning-Modell zur Überwachung der Pflanzengesundheit mithilfe von Fernerkundungsdaten. Das System analysiert Satelliten- und Drohnenbilder, um Pflanzenkrankheiten und Nährstoffmängel zu erkennen und Bewässerungspläne zu optimieren. Erreichte 92% Genauigkeit bei der Krankheitserkennung über mehrere Kultursorten hinweg."
        },
        {
            "id": 3,
            "title": "BIN Bot - COVID-Sicherheitsroboter",
            "description": "Autonomer Roboter für Abfallmanagement und Sicherheit",
            "image": "/portfolio/images/hobby-project.png",
            "technologies": [
                "ROS",
                "Python",
                "Computer Vision",
                "Arduino",
                "Sensoren"
            ],
            "detailedDescription": "Entwarf und baute einen autonomen Roboter, der darauf abzielt, die Krankheitsausbreitung in Institutionen und Arbeitsplätzen zu reduzieren. Der BIN Bot integriert Computer Vision für Navigation, automatische Abfallsammlungsfunktionen und COVID-19-Sicherheitsprotokoll-Durchsetzung durch kontaktlose Operationen."
        },
        {
            "id": 4,
            "title": "Automatische Schlauchschneidemaschine",
            "description": "Präzisions-Automatisierungssystem für industriellen Einsatz",
            "image": "/portfolio/images/hobby-project.png",
            "technologies": [
                "SPS",
                "HMI",
                "Automatisierung",
                "Mechanisches Design"
            ],
            "detailedDescription": "Entwarf und fertigte eine automatische Schlauchschneidemaschine, die eine Lösung für den zeitaufwändigen Prozess des präzisen Schlauchschneidens in industriellen Umgebungen bietet. Das System nutzt SPS-Programmierung für genaue Längenmessung und Schneiden, reduziert Abfall und verbessert die Produktionseffizienz um 60%."
        },
        {
            "id": 5,
            "title": "Eierqualitäts-Erkennungsgerät",
            "description": "IoT-Gerät für intelligente Eierqualitätsbewertung",
            "image": "/portfolio/images/hobby-project.png",
            "technologies": [
                "Arduino",
                "Sensoren",
                "IoT",
                "Mobile App"
            ],
            "detailedDescription": "Erfand ein Handgerät, das die Eierqualität für Verbraucher vorhersagt und erkennt. Das Gerät misst Gewicht und Temperatur und nutzt diese Parameter, um die Frische der Eier zu bestimmen und Verfallsdaten vorherzusagen. Die begleitende Mobile App zeigt Qualitätsbewertungen und Frischeindikatoren an."
        },
        {
            "id": 6,
            "title": "Humanoider Mitarbeiter-Tracking-Bot",
            "description": "KI-gestützter Roboter für Arbeitsplatzautomatisierung",
            "image": "/portfolio/images/hobby-project.png",
            "technologies": [
                "Python",
                "Computer Vision",
                "Deep Learning",
                "ROS",
                "Gesichtserkennung"
            ],
            "detailedDescription": "Als Abschlussprojekt bei ELGI R&D entwickelt, automatisiert dieser humanoide Bot die Mitarbeiterverfolgung und gewährleistet die Einhaltung von COVID-SOP. Implementierte Deep Learning-Modelle für Gesichtserkennung, Social-Distancing-Erkennung und Maskenerkennung mit Echtzeitwarnungen und Berichtsfunktionen."
        },
        {
            "id": 7,
            "title": "KI-Code-Assistent",
            "description": "LLM-gestützter Coding-Begleiter",
            "image": "/portfolio/images/hobby-project.png",
            "technologies": [
                "Python",
                "GPT",
                "VS Code Extension",
                "TypeScript"
            ],
            "detailedDescription": "Baute einen intelligenten Coding-Assistenten, der LLMs nutzt, um Code-Vorschläge, Bug-Erkennung und Dokumentationsgenerierung bereitzustellen. Das Tool integriert sich nahtlos in beliebte IDEs und unterstützt mehrere Programmiersprachen, um Entwicklern zu helfen, schneller besseren Code zu schreiben."
        }
    ]
}