{
    "en": [
        {
            "id": 1,
            "title": "LLM-based Customer Support Chatbot",
            "description": "AI-powered chatbot using DialoGPT for automated customer support",
            "image": "/portfolio/images/project.png",
            "technologies": [
                "Python",
                "DialoGPT",
                "NLP",
                "TensorFlow",
                "FastAPI"
            ],
            "link": "",
            "detailedDescription": "Developed and fine-tuned DialoGPT model to create an intelligent customer support chatbot at Vuram Technologies. The system reduced human intervention in support tickets from 70% to 35% and cut response time by approximately 40%. Implemented advanced NLP techniques for intent recognition and context-aware responses, handling thousands of customer queries daily with high accuracy."
        },
        {
            "id": 2,
            "title": "Intelligent Document Processing System",
            "description": "AI-powered IDP solution for automated form processing",
            "image": "/portfolio/images/project.png",
            "technologies": [
                "Python",
                "OCR",
                "Machine Learning",
                "Computer Vision",
                "Azure AI"
            ],
            "link": "",
            "detailedDescription": "Led the development of an Intelligent Document Processing (IDP) system that automated manual form processing workflows. Reduced processing time from 2 hours to just 30 minutes per batch. Integrated advanced OCR, computer vision, and machine learning models to extract, validate, and process information from various document formats with 95%+ accuracy."
        },
        {
            "id": 3,
            "title": "Self-Balancing Electric Two-Wheeler",
            "description": "Gyroscope-based self-balancing vehicle system with AI control",
            "image": "/portfolio/images/project.png",
            "technologies": [
                "Embedded C",
                "Arduino",
                "Gyroscope",
                "PID Control",
                "IoT"
            ],
            "link": "https://drive.google.com/file/d/1RvnB1hGGzvoJsApCSkzQEMVv_Gmb3XWN/view?usp=sharing",
            "detailedDescription": "Designed and developed a self-balancing electric two-wheeler using gyroscopic stabilization and advanced control algorithms. Implemented PID controllers for real-time balance adjustment and created a patent for the innovative gyroscopic design. The project demonstrates expertise in robotics, control systems, and embedded programming."
        }
    ],
    "de": [
        {
            "id": 1,
            "title": "LLM-basierter Kundensupport-Chatbot",
            "description": "KI-gestützter Chatbot mit DialoGPT für automatisierten Kundensupport",
            "image": "/portfolio/images/project.png",
            "technologies": [
                "Python",
                "DialoGPT",
                "NLP",
                "TensorFlow",
                "FastAPI"
            ],
            "link": "",
            "detailedDescription": "Entwicklung und Feinabstimmung des DialoGPT-Modells zur Erstellung eines intelligenten Kundensupport-Chatbots bei Vuram Technologies. Das System reduzierte die menschliche Intervention bei Support-Tickets von 70% auf 35% und verkürzte die Antwortzeit um etwa 40%. Implementierte fortschrittliche NLP-Techniken für Intent-Erkennung und kontextbewusste Antworten, die täglich Tausende von Kundenanfragen mit hoher Genauigkeit bearbeiten."
        },
        {
            "id": 2,
            "title": "Intelligentes Dokumentenverarbeitungssystem",
            "description": "KI-gestützte IDP-Lösung für automatisierte Formularverarbeitung",
            "image": "/portfolio/images/project.png",
            "technologies": [
                "Python",
                "OCR",
                "Machine Learning",
                "Computer Vision",
                "Azure AI"
            ],
            "link": "",
            "detailedDescription": "Leitete die Entwicklung eines intelligenten Dokumentenverarbeitungssystems (IDP), das manuelle Formularverarbeitungs-Workflows automatisierte. Reduzierte die Verarbeitungszeit von 2 Stunden auf nur 30 Minuten pro Batch. Integrierte fortschrittliche OCR-, Computer Vision- und Machine Learning-Modelle, um Informationen aus verschiedenen Dokumentenformaten mit über 95% Genauigkeit zu extrahieren, zu validieren und zu verarbeiten."
        },
        {
            "id": 3,
            "title": "Selbstbalancierendes Elektro-Zweirad",
            "description": "Gyroskop-basiertes selbstbalancierendes Fahrzeugsystem mit KI-Steuerung",
            "image": "/portfolio/images/project.png",
            "technologies": [
                "Embedded C",
                "Arduino",
                "Gyroskop",
                "PID-Regelung",
                "IoT"
            ],
            "link": "https://drive.google.com/file/d/1RvnB1hGGzvoJsApCSkzQEMVv_Gmb3XWN/view?usp=sharing",
            "detailedDescription": "Entwurf und Entwicklung eines selbstbalancierenden Elektro-Zweirads mit gyroskopischer Stabilisierung und fortschrittlichen Steuerungsalgorithmen. Implementierte PID-Regler für Echtzeit-Balance-Anpassung und erstellte ein Patent für das innovative gyroskopische Design. Das Projekt demonstriert Expertise in Robotik, Steuerungssystemen und Embedded-Programmierung."
        }
    ]
}